In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('../data/marketing_campaign_concat1.csv')
df2 = pd.read_csv('../data/marketing_campaign_concat2.csv')

In [3]:
df1.head()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [4]:
df2.head()

,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,3,8,10,4,7
1,2,1,1,2,5
2,1,8,2,10,4
3,2,2,0,4,6
4,5,5,3,6,5

In [6]:
df1.shape, df2.shape

((2240, 5), (2240, 5))

In [11]:
df1.isnull().sum()

ID                 0
Year_Birth         0
Education          0
Marital_Status     0
Income            24
dtype: int64

In [12]:
df2.isnull().sum()

NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
dtype: int64

In [13]:
concatenated_data = pd.concat([df1, df2], axis=1)
concatenated_data.shape

(2240, 10)

In [16]:
concatenated_data.head()

,ID,Year_Birth,Education,Marital_Status,Income,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,3,8,10,4,7
1,2174,1954,Graduation,Single,46344.0,2,1,1,2,5
2,4141,1965,Graduation,Together,71613.0,1,8,2,10,4
3,6182,1984,Graduation,Together,26646.0,2,2,0,4,6
4,5324,1981,PhD,Married,58293.0,5,5,3,6,5